oscillatingInletTutorial/constant/fvMesh/polyFaces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceLabelField;
    location    "constant/fvMesh";
    object      polyFaces;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform -1;

boundaryField
{
    inlet
    {
        type            polyFaces;
    }
    outlet
    {
        type            polyFaces;
    }
    walls
    {
        type            polyFaces;
    }
    nonCouple1
    {
        type            polyFaces;
    }
    nonCouple2
    {
        type            polyFaces;
    }
    defaultFaces
    {
        type            polyFaces;
    }
    nonConformalCyclic_on_nonCouple1
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalCyclic;
        size            78;
        value           nonuniform List<label> 
78
(
21920
21920
21921
21921
21922
21922
21923
21923
...
)
;
    }
    nonConformalCyclic_on_nonCouple2
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalCyclic;
        size            78;
        value           nonuniform List<label> 
78
(
21988
21989
21989
21990
21990
21991
21991
21992
...
)
;
    }
    nonConformalError_on_nonCouple1
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalError;
        size            0;
        value           nonuniform List<label> 0();
    }
    nonConformalError_on_nonCouple2
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalError;
        size            0;
        value           nonuniform List<label> 0();
    }
}


// ************************************************************************* //
